package com.TheVision.tv;

public class QGKhindi {

    public String questions[] = {
            "ग्रांड सेंट्रल टर्मिनल, पार्क एवेन्यू, न्यूयॉर्क",
            "कौन एक प्रोग्रामिंग लैंग्वेज है?",
            "COMAL भाषा कार्यक्रम में, प्रक्रिया मानकों के नाम के बाद होना चाहिए?",
            "प्रोग्रामिंग भाषा COBOL में उपयोग के लिए सबसे अच्छा काम करता है?",
            "एंटोमोलॉजी वह विज्ञान है जो अध्ययन करता है",
            "इरिट्रिया, जो 1993 में संयुक्त राष्ट्र का 182 वां सदस्य बन गया, के महाद्वीप में है",
            "गारमणि अभयारण्य कहा पे स्थित है",
            "निम्नलिखित में से किस विषय के लिए नोबेल पुरस्कार दिया जाता है?",
            "1933 में सत्ता में आई हिटलर पार्टी के रूप में जानी जाती है",
            "एफएफसी खड़ा है",
            "सबसे तेज आशुलिपि लेखक थे",
            "एप्सम (इंग्लैंड) से जुड़ी जगह है",
            "लुई वाशकेन्स्की पर डॉ। क्रिस्टियान बर्नार्ड द्वारा आयोजित पहला मानव हृदय प्रत्यारोपण ऑपरेशन किया गया था",
            "गैलीलियो एक इतालवी खगोलशास्त्री थे",
            "हैबियस कॉर्पस एक्ट 1679",
            "धूप के संपर्क में आने से व्यक्ति को अपने स्वास्थ्य को बेहतर बनाने में मदद मिलती है क्योंकि",
            "गोल्फ खिलाड़ी विजय सिंह किस देश के हैं?",
            "एक निर्यातक को गारंटी दी जाती है कि उसके माल का आयातक उसके द्वारा दिए गए माल के लिए तुरंत भुगतान करेगा, के रूप में जाना जाता है",
            "पहले अफगान युद्ध कहा पे हुआ",
            "खाड़ी सहयोग परिषद मूल रूप से द्वारा गठित किया गया था",
            " प्रथम चीन युद्ध किसके बीच लड़ा गया था",
            "डंपिंग है",
            "ओलंपिक और विश्व टूर्नामेंट के लिए, बास्केटबॉल कोर्ट के आयाम हैं",
            "फेडरेशन कप, विश्व कप, एल्विन इंटरनेशनल ट्रॉफी और चैलेंज कप के विजेताओं को सम्मानित किया जाता है",
            "प्रत्येक वर्ष विश्व रेड क्रॉस और लाल क्रीसेंट दिवस मनाया जाता है",
            "950 ई। 1050 ई। में किसी समय निर्मित प्रेम कला को दर्शाने वाली प्रसिद्ध मूर्तियाँ हैं",
            "क्या हटाने के लिए उद्योगों में गुरुत्वाकर्षण सेटिंग चैंबर का उपयोग किया जाता है",
            "गुवाहाटी कहा की उच्च न्यायालय की न्यायपालिका है",
            " कहा से बदलकर घर्षण को कम किया जा सकता है",
            "ग्यारहवीं अंटार्कटिक अभियान के दौरान नवंबर 1991 / मार्च 1992 में ____ था",
    };

    public String choices[][] = {
            {"सबसे बड़ा रेलवे स्टेशन", "सबसे ऊंचा रेलवे स्टेशन", "सबसे लंबा रेलवे स्टेशन", "उपरोक्त में से कोई नहीं"},
            {"HTML", "CSS", "PHP", "कुछ भी नहीं"},
            {"दंड चिह्न", "बैक-स्लैश", "ब्रैकेट", "सेमी कोलोन"},
            {"सीमेंस एप्लीकेशन", "स्टूडेंट एप्लीकेशन", "सोशल एप्लीकेशन", "कमर्शियल एप्लीकेशन"},
            {"मानव का व्यवहार", "कीट", "तकनीकी और वैज्ञानिक शब्दों की उत्पत्ति और इतिहास", "चट्टानों का निर्माण"},
            {"एशिया", "अफ्रीका", "यूरोप", "ऑस्ट्रेलिया"},
            {"जूनागढ़, गुजरात", "दीफू, असम", "कोहिमा, नागालैंड", "गंगटोक, सिक्किम"},
            {"भौतिकी और रसायन विज्ञान", "फिजियोलॉजी या चिकित्सा साहित्य", "शांति और अर्थशास्त्र", "सब"},
            {"लेबर पार्टी", "नाजी दल", "कू-क्लक्स-क्लान", "डेमोक्रेटिक पार्टी"},
            {"विदेशी वित्त निगम", "फिल्म वित्त निगम", "फेडरेशन ऑफ फुटबॉल काउंसिल", "कोई नहीं विकल्प"},
            {"डॉ। जी। बिष्ट", "जे। आर। टाटा", "जे.एम. टैगोर", "खुदा खान",},
            {"हॉर्स रेसिंग", "पोलो", "शूटिंग", "स्नूकर"},
            {"1958", "1968", "1967", "1922"},
            {"दूरबीन विकसित की","बृहस्पति के चार उपग्रहों की खोज की","पता चला कि पेंडुलम की गति एक नियमित समय माप पैदा करती है", "उपरोक्त सभी"},
            {"कहता है कि किसी को बिना किसी रिट या वारंट के कैद नहीं किया गया था, जो उसके खिलाफ आरोप लगा रहा था","एक कैदी को त्वरित मुकदमे या जमानत में रिहा करने के लिए सुविधाएं प्रदान की गईं,\" मनमाने कारावास के खिलाफ लोगों की व्यक्तिगत स्वतंत्रता की रक्षा की। राजा के आदेश "," उपरोक्त सभी "},
            {"अवरक्त प्रकाश शरीर में बैक्टीरिया को मारता है", "प्रतिरोध शक्ति बढ़ती है", "त्वचा में वर्णक कोशिकाएं उत्तेजित हो जाती हैं और एक स्वस्थ तन उत्पन्न करती हैं", "पराबैंगनी किरणें त्वचा के तेल को विटामिन डी में बदल देती हैं"},
            {"यूएसए","फ़िजी", "भारत", "यूके"},
            {"लेटर ऑफ क्रेडिट (L / C)", "लाईसेस्ज़फायर", "मुद्रास्फीति", "उपरोक्त में से कोई नहीं"},
            {"1838", "1843", "1833", "1839"},
            {"बहरीन, कुवैत, ओमान, कतर, सऊदी अरब और संयुक्त अरब अमीरात", "दूसरा विश्व राष्ट्र", "तीसरा विश्व राष्ट्र", "चौथा विश्व राष्ट्र"},
            {"चीन और ब्रिटेन", "चीन और फ्रांस", "चीन और मिस्र", "चीन और ग्रीक"},
            {"GATT के नियमों द्वारा निषिद्ध घरेलू बाजार में उत्पादन की लागत से कम कीमत पर विदेश में सामानों की बिक्री "," जिसके द्वारा एक निर्माण के उत्पाद की आपूर्ति घरेलू बाजार में कम रहती है, जो उसे बेहतर कीमत देता है ","उपरोक्त सभी"},
            {"26 m x 14 m","28 m x 15 m","27 m x 16 m","28 m x 16 m"},
            { "टेनिस", "वॉलीबॉल", "बास्केटबॉल", "क्रिकेट"},
            {"8 मई", "18 मई", "8 जून", "18 जून"},
            {"खजुराहो मंदिर", "जामा मस्जिद", "सूर्य मंदिर", "महाबलीपुरम मंदिर"},
            {"SOx", "NOx", "निलंबित कण पदार्थ", "CO"},
            {"नागालैंड", "अरुणाचल प्रदेश", "असम", "उपरोक्त सभी"},
            {"रॉलिंग टू रोलिंग", "रॉलिंग टू रॉलिंग", "संभावित एनर्जी टू कैनेटिक एनर्जी", "डायनेमिक टू स्टैटिक",},
            {"सोनिक डिटेक्शन एंड रेंजिंग", "दूसरा स्थायी स्टेशन 'मैत्री", "पहला स्थायी स्टेशन' दक्षिण गंगोत्री ","इनमे से कोई भी नहीं"},
    };

    public String correctAnswer[] = {
            "सबसे बड़ा रेलवे स्टेशन",
            "PHP",
            "सेमी कोलोन",
            "कमर्शियल एप्लीकेशन",
            "कीट",
            "अफ्रीका",
            "दीफू, असम",
            "सब",
            "नाजी दल",
            "फेडरेशन ऑफ फुटबॉल काउंसिल",
            "डॉ। जी। बिष्ट",
            "हॉर्स रेसिंग",
            "1967",
            "उपरोक्त सभी",
            "उपरोक्त सभी",
            "पराबैंगनी किरणें त्वचा के तेल को विटामिन डी में बदल देती हैं",
            "फ़िजी",
            "लेटर ऑफ क्रेडिट (L / C)",
            "1839",
            "बहरीन, कुवैत, ओमान, कतर, सऊदी अरब और संयुक्त अरब अमीरात",
            "चीन और ब्रिटेन",
            "उपरोक्त सभी",
            "28 m x 16 m",
            "वॉलीबॉल",
            "8 मई",
            "खजुराहो मंदिर",
            "निलंबित कण पदार्थ",
            "उपरोक्त सभी",
            "रॉलिंग टू रोलिंग",
            "सोनिक डिटेक्शन एंड रेंजिंग",

    };

    public String getQuestion(int a){
        String question = questions[a];
        return question;
    }

    public String getchoice1(int a){
        String choice = choices[a][0];
        return choice;
    }

    public String getchoice2(int a){
        String choice = choices[a][1];
        return choice;
    }

    public String getchoice3(int a){
        String choice = choices[a][2];
        return choice;
    }

    public String getchoice4(int a){
        String choice = choices[a][3];
        return choice;
    }

    public String getCorrectAnswer(int a){
        String answer = correctAnswer[a];
        return answer;
    }
}
